---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.FabricLocation
source: html/2d0de815-de85-6ca8-13f0-26dcecb5ac85.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.FabricLocation Property

The Fabric Sheet location in the host.

## Syntax (C#)
```csharp
public FabricLocation FabricLocation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: